const MODULES = [
    {
      id: "intro-to-javascript",
      chapter: "1",
      name: "1. INTRODUCTION TO JAVASCRIPT",
      numberOfTasks: "8",
      tasks: [
        {
          id: "1",
          nameTask: "Display your name: ",
          descriptionTask:
            "Напишіть скріпт всередині HTML-документу, який виводить на екран ваше імя за допомогою функції alert().",
        },
        {
          id: "2",
          nameTask: "Display your surname: ",
          descriptionTask:
            "Напишіть скріпт в зовнішньому файлі, який виводить в консоль ваше прізвище. Підключіть створений файл до HTML-документу.",
        },
        {
          id: "3",
          nameTask: "Variables: ",
          descriptionTask:
            "a) оголосіть дві змінні; <br>b) запишіть у змінні будь-які значення; <br>c) виведіть на екран значення змінних; <br>d) скопіюйте значення однієї змінної в іншу; <br>e) виведіть на екран значення змінних.",
        },
        {
          id: "4",
          nameTask: "Object: ",
          descriptionTask:
            "Створіть об’єкт з 5-ма наступними властивостями: “String”, “Number”, “Boolean”, “Undefined”, “Null”. <br>Значення кожної властивості повинно відповідати відповідному примітивному типу даних.",
        },
        {
          id: "5",
          nameTask: "Legal age:",
          descriptionTask:
            "Використовуючи функцію confirm() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult і виведіть в консоль.",
        },
        {
          id: "6",
          nameTask: "Personal data: ",
          descriptionTask:
            "В зовнішньому файлі напишіть скріпт, в якому оголосіть змінні, для збереження таких даних: <br>&#9900; ваше ім’я <br>&#9900; ваше прізвище <br>&#9900; навчальна група <br>&#9900; ваш рік народження. <br>Присвойте змінним відповідні значення. <br>Створіть та проініціалізуйте логічну змінну для збереження вашого сімейного стану. <br>Визначте тип кожної змінної. <br>Виведіть значення змінних в консоль, відповідно до їх типу, в такому порядку: Number, Boolean, String. <br>Створіть 2 довільних змінних типу Null і Undefined відповідно. Виведіть їх тип в консоль.",
        },
        {
          id: "7",
          nameTask: "Authorization data: ",
          descriptionTask:
            "За допомогою функції prompt() напишіть скріпт, який послідовно запитує в користувача логін, емейл та пароль, і виводить на екран повідомлення із введеними даними. Наприклад “Dear User, your email is usermale@gmail.com, your password is qwerty”.",
        },
        {
          id: "8",
          nameTask: "Counting seconds: ",
          descriptionTask:
            "Напишіть скріпт, який вираховує кількість секунд в годині, в добі, в місяці, записує результати в відповідні змінні, і виводить їх значення на екран.",
        },
      ],
    },
    {
      id: "operators-arrays",
      chapter: "2",
      name: "2. OPERATORS. TYPE CONVERSIONS. ARRAYS. CONDITIONAL STATEMENT",
      numberOfTasks: "7",
      tasks: [
        {
          id: "1",
          nameTask: "True or false: ",
          descriptionTask:
            "Дано три цілих числа: a, b, c. Перевірте істинність висловлювання: a < b < c.",
        },
        {
          id: "2",
          nameTask: "Continue the code: ",
          descriptionTask:
            "Є такий код:<br> <samp>let x = 1;<br>let y = 2;<br><br>let res1 = // Допишіть код, необхідно використовувати змінні x і y<br>console.log(res1); // '12'<br>console.log(typeof res1); // 'string'<br><br>let res2 = // Допишіть код, необхідно використовувати змінні x і y<br>console.log(res2); // 'true2'<br>console.log(typeof res2); // 'string'<br><br>let res3 = // Допишіть код, необхідно використовувати змінні x і y<br>console.log(res3); // true<br>console.log(typeof res3); // 'boolean'<br><br>let res4 = // Допишіть код, необхідно використовувати змінні x і y<br>console.log(res4); // NaN<br>console.log(typeof res4); // 'number'<br><br></samp> Допишіть код, щоб в консолі браузера з'явилися рядки, які написані в коментарях, оперуючи при цьому змінними х і у.",
        },
        {
          id: "3",
          nameTask: "Are you underage? ",
          descriptionTask:
            "Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення про статус особи. Наприклад: при виконанні умови вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 18 років вивести “Ви ще надто молоді”.",
        },
        {
          id: "4",
          nameTask: "Area of a triangle: ",
          descriptionTask:
            "Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони). <br>Необхідно:  <br>a) визначити і вивести в консоль площу трикутника <br>b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки. <br>Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424).",
        },
        {
          id: "5",
          nameTask: "Greeting: ",
          descriptionTask:
            "Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.<br>&#9900; В діапазоні годин 23-5 – має виводитися привітання 'Доброї ночі' <br>&#9900; В діапазоні годин 5-11 – має виводитися привітання 'Доброго ранку' <br>&#9900; В діапазоні годин 11-17 – має виводитися привітання 'Доброго дня' <br>&#9900; В діапазоні годин 17-23 – має виводитися привітання 'Доброго вечора'.",
        },
        {
          id: "6",
          nameTask: "The most common number in the array: ",
          descriptionTask:
            "Задано масив чисел, знайти число яке найбільш часто входить в масив, занести це число в новий масив і видалити всі входження цього числа із поточного масиву.<br><samp>let arr = [4, 5, 2, 1, 6, 5, 3, 5, 2, 5]<br>let data = ... // 5<br>...<br>console.log(arr) // [4, 2, 1, 6, 3, 2]",
        },
        {
          id: "7",
          nameTask: "&#10025; &#10025; &#10025; Vasya Vasylyok",
          descriptionTask:
            "Вася працює програмістом і отримує 50$ за кожні 100 рядків коду (99 рядків - 0$, 199 рядків - 50$). За кожне третє запізнення Васю штрафують на 20$. Реалізувати меню: <br>&#9900; користувач вводить бажаний дохід Васі і кількість запізнень, порахувати, скільки рядків коду йому треба написати; <br>&#9900; користувач вводить кількість рядків коду, написану Васею, і бажаний обсяг коштів. Порахувати, скільки разів Вася може запізнитися; <br>&#9900; користувач вводить кількість рядків коду і кількість запізнень, визначити, скільки грошей заплатять Васі і чи заплатять взагалі.",
        }
      ],
    },
  ];